applications/test/heatTransfer/buoyantDBS/calciteCrystalThermalFlow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    "epsSolid.*"
    {
        solver          diagonal;
    }


    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|Y)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.01;
    }

    "(U|Y)Final"
    {
        $U;
        relTol          0;
    }

    
    "(e|h)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.001;
    }

    "(e|h)Final"
    {
        $e;
        relTol          0;
    }


}

PIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    nCorrectors       2;
    nOuterCorrectors  20;

    outerCorrectorResidualControl
    {
        e     
        {
            tolerance  1e-6;
            relTol     0;
        }

        p_rgh      
        {
            tolerance  1e-6;
            relTol     0;
        }
        
    }

    p_rghRefCell          (2e-4 0 0);
    p_rghRefValue         0;
}



// ************************************************************************* //
